#2. Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N в виде списка.

N = int (input ('Введите N - '))
print (N)
for i in range (N+1):
   
